{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "WhitespaceSplit"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "TIME_DELTA=1": 5,
      "TIME_DELTA=2": 6,
      "BAR_END": 7,
      "BAR_START": 8,
      "NOTE_OFF=42": 9,
      "NOTE_ON=42": 10,
      "TIME_DELTA=4": 11,
      "NOTE_OFF=36": 12,
      "NOTE_ON=36": 13,
      "NOTE_OFF=38": 14,
      "NOTE_ON=38": 15,
      "NOTE_OFF=40": 16,
      "NOTE_ON=40": 17,
      "NOTE_OFF=57": 18,
      "NOTE_ON=57": 19,
      "NOTE_OFF=35": 20,
      "NOTE_ON=35": 21,
      "TIME_DELTA=3": 22,
      "NOTE_OFF=54": 23,
      "NOTE_ON=54": 24,
      "NOTE_OFF=64": 25,
      "NOTE_ON=64": 26,
      "NOTE_OFF=59": 27,
      "NOTE_ON=59": 28,
      "NOTE_OFF=62": 29,
      "NOTE_ON=62": 30,
      "NOTE_OFF=44": 31,
      "NOTE_ON=44": 32,
      "NOTE_OFF=46": 33,
      "NOTE_ON=46": 34,
      "NOTE_OFF=50": 35,
      "NOTE_ON=50": 36,
      "NOTE_OFF=69": 37,
      "NOTE_ON=69": 38,
      "NOTE_OFF=55": 39,
      "NOTE_ON=55": 40,
      "NOTE_OFF=60": 41,
      "NOTE_ON=60": 42,
      "NOTE_OFF=52": 43,
      "NOTE_ON=52": 44,
      "NOTE_OFF=61": 45,
      "NOTE_ON=61": 46,
      "NOTE_OFF=66": 47,
      "NOTE_ON=66": 48,
      "NOTE_OFF=45": 49,
      "NOTE_ON=45": 50,
      "NOTE_OFF=67": 51,
      "NOTE_ON=67": 52,
      "NOTE_OFF=70": 53,
      "NOTE_ON=70": 54,
      "TRACK_END": 55,
      "TRACK_START": 56,
      "NOTE_OFF=51": 57,
      "NOTE_ON=51": 58,
      "NOTE_OFF=48": 59,
      "NOTE_ON=48": 60,
      "NOTE_OFF=56": 61,
      "NOTE_ON=56": 62,
      "NOTE_OFF=65": 63,
      "NOTE_ON=65": 64,
      "NOTE_OFF=49": 65,
      "NOTE_ON=49": 66,
      "NOTE_OFF=53": 67,
      "NOTE_ON=53": 68,
      "NOTE_OFF=58": 69,
      "NOTE_ON=58": 70,
      "NOTE_OFF=63": 71,
      "NOTE_ON=63": 72,
      "NOTE_OFF=43": 73,
      "NOTE_ON=43": 74,
      "NOTE_OFF=47": 75,
      "NOTE_ON=47": 76,
      "NOTE_OFF=68": 77,
      "NOTE_ON=68": 78,
      "NOTE_OFF=71": 79,
      "NOTE_ON=71": 80,
      "NOTE_OFF=33": 81,
      "NOTE_ON=33": 82,
      "NOTE_OFF=41": 83,
      "NOTE_ON=41": 84,
      "TIME_DELTA=6": 85,
      "NOTE_OFF=39": 86,
      "NOTE_ON=39": 87,
      "NOTE_OFF=74": 88,
      "NOTE_ON=74": 89,
      "TIME_DELTA=8": 90,
      "NOTE_OFF=72": 91,
      "NOTE_ON=72": 92,
      "NOTE_OFF=76": 93,
      "NOTE_ON=76": 94,
      "TIME_DELTA=16": 95,
      "NOTE_OFF=28": 96,
      "NOTE_ON=28": 97,
      "NOTE_OFF=73": 98,
      "NOTE_ON=73": 99,
      "NOTE_OFF=82": 100,
      "NOTE_ON=82": 101,
      "NOTE_OFF=37": 102,
      "NOTE_ON=37": 103,
      "NOTE_OFF=34": 104,
      "NOTE_ON=34": 105,
      "NOTE_OFF=81": 106,
      "NOTE_ON=81": 107,
      "NOTE_OFF=31": 108,
      "NOTE_ON=31": 109,
      "NOTE_OFF=75": 110,
      "NOTE_ON=75": 111,
      "NOTE_OFF=78": 112,
      "NOTE_ON=78": 113,
      "NOTE_OFF=29": 114,
      "NOTE_ON=29": 115,
      "NOTE_OFF=79": 116,
      "NOTE_ON=79": 117,
      "NOTE_OFF=30": 118,
      "NOTE_ON=30": 119,
      "TIME_DELTA=5": 120,
      "NOTE_OFF=32": 121,
      "NOTE_ON=32": 122,
      "DENSITY=3": 123,
      "DENSITY=2": 124,
      "NOTE_OFF=77": 125,
      "NOTE_ON=77": 126,
      "DENSITY=1": 127,
      "TIME_DELTA=7": 128,
      "DENSITY=0": 129,
      "NOTE_OFF=27": 130,
      "NOTE_ON=27": 131,
      "NOTE_OFF=26": 132,
      "NOTE_ON=26": 133,
      "INST=DRUMS": 134,
      "TIME_DELTA=12": 135,
      "TIME_DELTA=10": 136,
      "PIECE_START": 137,
      "NOTE_OFF=83": 138,
      "NOTE_ON=83": 139,
      "NOTE_OFF=80": 140,
      "NOTE_ON=80": 141,
      "TIME_DELTA=14": 142,
      "NOTE_OFF=84": 143,
      "NOTE_ON=84": 144,
      "NOTE_OFF=86": 145,
      "NOTE_ON=86": 146,
      "TIME_DELTA=15": 147,
      "NOTE_OFF=88": 148,
      "NOTE_ON=88": 149,
      "INST=30": 150,
      "NOTE_OFF=87": 151,
      "NOTE_ON=87": 152,
      "NOTE_OFF=85": 153,
      "NOTE_ON=85": 154,
      "INST=29": 155,
      "INST=33": 156,
      "TIME_DELTA=9": 157,
      "NOTE_OFF=24": 158,
      "NOTE_ON=24": 159,
      "TIME_DELTA=13": 160,
      "NOTE_OFF=22": 161,
      "NOTE_ON=22": 162,
      "NOTE_OFF=91": 163,
      "NOTE_ON=91": 164,
      "TIME_DELTA=11": 165,
      "NOTE_OFF=93": 166,
      "NOTE_ON=93": 167,
      "INST=27": 168,
      "INST=0": 169,
      "INST=25": 170,
      "NOTE_OFF=25": 171,
      "NOTE_ON=25": 172,
      "NOTE_OFF=89": 173,
      "NOTE_ON=89": 174,
      "NOTE_OFF=90": 175,
      "NOTE_ON=90": 176,
      "INST=26": 177,
      "NOTE_OFF=98": 178,
      "NOTE_ON=98": 179,
      "NOTE_OFF=96": 180,
      "NOTE_ON=96": 181,
      "INST=48": 182,
      "INST=34": 183,
      "NOTE_OFF=16": 184,
      "NOTE_ON=16": 185,
      "INST=28": 186,
      "INST=24": 187,
      "NOTE_OFF=23": 188,
      "NOTE_ON=23": 189,
      "INST=35": 190,
      "INST=38": 191,
      "INST=52": 192,
      "INST=5": 193,
      "INST=1": 194,
      "INST=53": 195,
      "NOTE_OFF=6": 196,
      "NOTE_ON=6": 197,
      "INST=32": 198,
      "NOTE_OFF=92": 199,
      "NOTE_ON=92": 200,
      "INST=81": 201,
      "INST=87": 202,
      "INST=49": 203,
      "INST=39": 204,
      "INST=73": 205,
      "INST=50": 206,
      "NOTE_OFF=20": 207,
      "NOTE_ON=20": 208,
      "NOTE_OFF=95": 209,
      "NOTE_ON=95": 210,
      "INST=85": 211,
      "INST=65": 212,
      "INST=54": 213,
      "NOTE_OFF=94": 214,
      "NOTE_ON=94": 215,
      "INST=66": 216,
      "INST=62": 217,
      "NOTE_OFF=109": 218,
      "NOTE_ON=109": 219,
      "INST=61": 220,
      "INST=89": 221,
      "INST=80": 222,
      "INST=119": 223,
      "INST=18": 224,
      "INST=90": 225,
      "INST=56": 226,
      "NOTE_OFF=100": 227,
      "NOTE_ON=100": 228,
      "NOTE_OFF=103": 229,
      "NOTE_ON=103": 230,
      "INST=4": 231,
      "INST=36": 232,
      "INST=100": 233,
      "INST=68": 234,
      "INST=16": 235,
      "INST=51": 236,
      "INST=7": 237,
      "INST=116": 238,
      "INST=91": 239,
      "INST=17": 240,
      "INST=2": 241,
      "INST=88": 242,
      "NOTE_OFF=19": 243,
      "NOTE_ON=19": 244,
      "INST=57": 245,
      "INST=75": 246,
      "INST=37": 247,
      "INST=60": 248,
      "INST=118": 249,
      "INST=71": 250,
      "INST=64": 251,
      "INST=103": 252,
      "NOTE_OFF=21": 253,
      "NOTE_ON=21": 254,
      "INST=12": 255,
      "INST=99": 256,
      "NOTE_OFF=101": 257,
      "NOTE_ON=101": 258,
      "NOTE_OFF=97": 259,
      "NOTE_ON=97": 260,
      "INST=70": 261,
      "INST=63": 262,
      "INST=55": 263,
      "NOTE_OFF=8": 264,
      "NOTE_ON=8": 265,
      "INST=9": 266,
      "INST=84": 267,
      "NOTE_OFF=18": 268,
      "NOTE_ON=18": 269,
      "INST=11": 270,
      "INST=82": 271,
      "INST=67": 272,
      "NOTE_OFF=107": 273,
      "NOTE_ON=107": 274,
      "INST=6": 275,
      "INST=93": 276,
      "INST=47": 277,
      "INST=127": 278,
      "INST=117": 279,
      "INST=40": 280,
      "NOTE_OFF=105": 281,
      "NOTE_ON=105": 282,
      "NOTE_OFF=110": 283,
      "NOTE_ON=110": 284,
      "INST=94": 285,
      "INST=45": 286,
      "INST=20": 287,
      "INST=95": 288,
      "INST=21": 289,
      "INST=46": 290,
      "INST=43": 291,
      "INST=79": 292,
      "NOTE_OFF=99": 293,
      "NOTE_ON=99": 294,
      "INST=22": 295,
      "INST=69": 296,
      "INST=121": 297,
      "INST=124": 298,
      "INST=8": 299,
      "NOTE_OFF=15": 300,
      "NOTE_ON=15": 301,
      "INST=14": 302,
      "INST=3": 303,
      "INST=105": 304,
      "INST=10": 305,
      "INST=15": 306,
      "INST=122": 307,
      "INST=102": 308,
      "INST=13": 309,
      "INST=31": 310,
      "INST=98": 311,
      "INST=96": 312,
      "INST=58": 313,
      "INST=44": 314,
      "INST=106": 315,
      "INST=59": 316,
      "NOTE_OFF=102": 317,
      "NOTE_ON=102": 318,
      "INST=42": 319,
      "INST=108": 320,
      "INST=120": 321,
      "NOTE_OFF=104": 322,
      "NOTE_ON=104": 323,
      "INST=115": 324,
      "INST=78": 325,
      "INST=83": 326,
      "INST=77": 327,
      "INST=101": 328,
      "INST=76": 329,
      "NOTE_OFF=124": 330,
      "NOTE_ON=124": 331,
      "NOTE_OFF=7": 332,
      "NOTE_ON=7": 333,
      "INST=104": 334,
      "INST=23": 335,
      "NOTE_OFF=12": 336,
      "NOTE_ON=12": 337,
      "INST=126": 338,
      "NOTE_OFF=125": 339,
      "NOTE_ON=125": 340,
      "INST=92": 341,
      "NOTE_OFF=17": 342,
      "NOTE_ON=17": 343,
      "INST=86": 344,
      "INST=113": 345,
      "INST=107": 346,
      "NOTE_OFF=106": 347,
      "NOTE_ON=106": 348,
      "NOTE_OFF=14": 349,
      "NOTE_ON=14": 350,
      "INST=41": 351,
      "NOTE_OFF=2": 352,
      "NOTE_ON=2": 353,
      "NOTE_OFF=108": 354,
      "NOTE_ON=108": 355,
      "INST=97": 356,
      "NOTE_OFF=122": 357,
      "NOTE_OFF=123": 358,
      "NOTE_OFF=126": 359,
      "NOTE_OFF=127": 360,
      "NOTE_ON=122": 361,
      "NOTE_ON=123": 362,
      "NOTE_ON=126": 363,
      "NOTE_ON=127": 364,
      "INST=74": 365,
      "NOTE_OFF=0": 366,
      "NOTE_OFF=3": 367,
      "NOTE_ON=0": 368,
      "NOTE_ON=3": 369,
      "INST=109": 370,
      "INST=125": 371,
      "NOTE_OFF=120": 372,
      "NOTE_ON=120": 373,
      "INST=19": 374,
      "NOTE_OFF=10": 375,
      "NOTE_ON=10": 376,
      "INST=72": 377,
      "INST=114": 378,
      "NOTE_OFF=1": 379,
      "NOTE_OFF=11": 380,
      "NOTE_ON=1": 381,
      "NOTE_ON=11": 382,
      "NOTE_OFF=9": 383,
      "NOTE_ON=9": 384,
      "NOTE_OFF=5": 385,
      "NOTE_ON=5": 386,
      "NOTE_OFF=13": 387,
      "NOTE_ON=13": 388,
      "NOTE_OFF=4": 389,
      "NOTE_ON=4": 390
    },
    "unk_token": "[UNK]"
  }
}